x = int(input("Введите число x: "))
a = int(input ("Введите число а: "))
b = int(input("Введите число b: "))
c = int(input("Введите число с: "))
m = int(input("Введите число m: "))
n = int(input ("Введите число n: "))


print(f"a) -1 / (x ** 0.5) = {- 1 / (x ** 0.5)}")
print(f " б) a / (b * c) = {a / (b * c)}")
print(*"s) (a / b) * c = Ca/ b)"
c)")
print(F"r) (a + b) / 2 = {(a + b) / 2}")
print(""д) (5 + (45 / 100)) * ((a + 2 * b ) / (2 - a)) \
= ((5 + (45 / 100)) * ((a + 2 "" b) / (2 - a))}")
print(*"e) (-b + sqrt((b * b) - (4 " a "" c) "" (50 / 100))) / (2 "" a) |
- 1(-b + ((b * b) - (4% a * c))
** 0.5) / (2 * 2))")
print(***) (-b + (1 / a)) / (2 / c) = ((-b + (1/3)) / (2/c)]")
print(*"3) 1 / (1 + ((a + b) / 2)) - {1 / (1 + ((a + b) / 2)33")
print(**n) 1 / (1 + (1 / (2 + (1 / (2 + (3/5))))))1
1 - 11 / (1 + (1 / (2 + (1 / 12 + (3 / 5)))3
print(f"k) 2  (m  n) = {2 "" 0)]")

